<style scoped>
  html, body{
    padding: 0;
    margin: 0;
  }

  section {
    margin-top: 88px;
  }

  h1 {
    text-align: center;
  }

  p {
    line-height: 25px;
    letter-spacing: 1px;
    margin-bottom: 25px;
  }

  .main {
    width: 80%;
    max-width: 870px;
    margin: auto;
  }

  .text-center {
    text-align: center;
  }


</style>

<template>
  <div class="main">
    <p class="text-center">Chapter 1</p>
    <article>
      <h1>運動方程式</h1>

      <section>
        <h2>一般化座標</h2>

        <div>
          <p>
            力学の基本的な概念の1つは<b>粒子</b>である。これにより、次元が運動の記述を無視する体を意味する。
            もちろん、そうすることの可能性は、関係する問題の調整に依存する。
            例えば、惑星は太陽に関する運動として考えられる粒子としてみなすことができるが、軸に関しての回転として考えることは
            できない。
          </p>

          <p>
            空間内の粒子の位置は半径ベクトル$r$によって定義される。成分はデカルト座標$x, y, z$である。時間$t$に関する$r$の
            導関数$v = dr/dt$は粒子の<i>速度</i>と呼ばれ、2番目の導関数$d^2{r}/dt^2$は<b>加速度</b>と呼ばれる。次は
            、慣習的に、文字の上にドットを付けることで時間に関係する微分を表す：$v = \dot{r}$。
          </p>

          <p>
            空間内の$N$粒子の系の位置を定義するために、$N$半径ペクトル（すなわち$3N$座標）を特定する必要がある。任意の系の
            位置を独自に定義するために指定されるはずの独自の数量は<b>自由度</b>の数と呼ばれる。ここで、この数は$3N$。これらの量は
            粒子のデカルト座標である必要はなく、問題の座標はより便利な座標のいくつかの選択を描画する。$s$自由度によって
            系の位置を完全な定義をする任意の$s$量$q_1, q_2, ..., q_s$は系の<b>一般化座標</b>と呼ばれ、導関数$\dot{q}_i$
            は<b>一般化速度</b>と呼ばれる。
          </p>

          <p>
            一般化座標の値が特定されるとき、考えられる瞬間での系の”力学的な状態”はそのあとすぐに系の位置が予測できる方法のように
            まだ決められない。座標の与えられた値について、系が任意の速度を持つことができ、微小な時間間隔$dt$の後の系の位置に
            影響する。
          </p>

          <p>
            もしすべての座標と速度が同時に特定されるなら、系の状態が完全に決定され、そのあとの運動が、原理的に、計算することができる
            ということが実験から知られる。数学的に、この意味は、もしすべての座標$q$と速度$\dot{q}$がいくつかの瞬間に与えられたなら、
            瞬間での加速度$\ddot{q}$は独自に定義される。
          </p>

          <p>
            加速度、速度、座標との関係は<b>運動方程式</b>と呼ばれる。2階微分は関数$q(t)$と等しく、積分は、原則として、
            これらの関数の決定、したがって系の経路の決定が可能になる。
          </p>
        </div>
      </section>

      <section>
        <h2>最小原理の法則</h2>

        <div>
          <p>
            力学的な系の運動を統合する法則のもっとも一般的な公式は、あらゆる力学系が明確な関数
            $L(q_1, q_2, ..., q_s, \dot{q}_1, \dot{q}_2, ..., \dot{q}_s, t)$、もしくは簡単に$L(q, \dot{q}, t)$
            によって特徴づけられ、系の運動がデカルト座標を満たす、
            <b>最小原理の法則</b>もしくは<b>ハミルトンの原理</b>である。
          </p>

          <p>
            微小$t_1$と$t_2$で、系が座標の二つの集合の値（$q^{(1)}$と$q^{(2)})$で定義した位置を占めるとする。その時、座標は
            積分
            $$
            \tag{2.1} S = \int^{t_s}_{t_1} L(q, \dot{q}, t)dt
            $$
            可能な最小値を取ってくる方法で位置の間で系が動く。関数$L$は構成する系の<b>ラグラジアン</b>と呼ばれ、積分$(2.1)$は
            <b>作用</b>と呼ばれる。
          </p>

          <p>
            ラグラジアンは$q$と$\dot{q}$で成り立つが、より高い次元の微分$\ddot{q}$、$\dddot{q}$などでは成り立たないという事実
            があり、すでに言及された結果を表す。系の力学的な状態は座標と速度が与えられたときに完全に定義される。
          </p>

          <p>
            積分$(2.1)$の最小化の問題を解決する微分方程式を導出してみる。簡単に、系が1つの自由度をもつことを初めに想定する。
            1つの関数$q(t)$が決めること。
          </p>

          <p>
            $q = q(t)$は$S$が最小値である関数であるとする。これは$q(t)$が式
            $$
            \tag{2.2} q(t) + \delta q(t)
            $$
            の関数によって取り換えられるときに増加する$S$であるという意味。$\delta q(t)$は$t_1$から$t_2$までの時間の間での
            小さいあらゆる場所である関数。$\delta q(t)$は<b>変動</b>と呼ばれる。なので、$t = t_1$と$t = t_2$によって、
            すべての関数$(2.2)$は値$q^{(1)}$と$q^{(2)}$を取り、
            $$
            \tag{2.3} \delta q(t_1) = \delta q(t_2) = 0
            $$
            を導く。
          </p>

          <!-- <p></p> -->
        </div>
      </section>
    </article>
  </div>
</template>

<script>
export default {
  mounted() {
    const katex = require('katex');
    document.addEventListener("DOMContentLoaded", function() {
      renderMathInElement(document.body, {delimiters: [
        {left: "\\[", right: "\\]", display: true},
        {left: "$$", right: "$$", display: true},
        {left: "$", right: "$", display: false}
      ]});
    });
  }
}
</script>